app/Controllers/Devices.php

    public function index()
    {
        $db = \Config\Database::connect();
        $devices = new DeviceModel();
        $devices = $devices->findAll();
---
SELECT *
FROM `devices`

    public function details()
    {
        $db = \Config\Database::connect();
        $devices = new DeviceModel();
        $devices = $devices->findAll();
---
SELECT *
FROM `devices`